# Створіть магазин канцтоварів використовуючи списки для зберігання елементів.
# Для додавання елементів створіть функцію, яка буде запитувати дані в користувача і зібрані дані у вигляді
# кортежу додавати у створений список на початку. Результат вивести на екран. Під час створення дотримуйтесь
# правил специфікації PEP 8.

def new_element():
    z = input('Введите код товара: ')
    x = input('Введите название товара: ')
    y = input('Введите цену: ')
    return(z, x, y)


shop = [('001', 'ручка', 1.9), ('002', 'карандаш', 2.1), ('003', 'резинка', 10.25),
        ('004', 'линейка', 5.1), ('005', 'альбом ', 15.4), ('006', 'папка А4 ', 12.4)]
while True:
    print('\nКаталог товаров:')
    for i in shop:
        print(i)
    x = input('Хотите ли добавить новый элемент?(Да/Нет)')
    x = x.strip().lower()
    if x == 'да':
        shop.insert(0, new_element())
    else:
        break





